Terraform Plan Output:
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.vm_instance must be replaced
-/+ resource "google_compute_instance" "vm_instance" {
      ~ cpu_platform               = "Intel Broadwell" -> (known after apply)
      ~ creation_timestamp         = "2025-08-22T01:39:54.785-07:00" -> (known after apply)
      ~ current_status             = "RUNNING" -> (known after apply)
      - enable_display             = false -> null
      ~ id                         = "projects/akash1047/zones/us-central1-c/instances/terraform-vm" -> (known after apply)
      ~ instance_id                = "4860009528613507637" -> (known after apply)
      ~ label_fingerprint          = "vezUS-42LLM=" -> (known after apply)
      - labels                     = {} -> null
      - metadata                   = {} -> null
      ~ metadata_fingerprint       = "uV-bRJrl444=" -> (known after apply)
      + metadata_startup_script    = <<-EOT # forces replacement
            #!/bin/bash
            set -e
            
            echo "Setup started!" > /tmp/setup.log
            echo "Installing docker" >> /tmp/setup.log
            
            # Add Docker's official GPG key:
            echo "Adding Docker's official GPG key..." >> /tmp/setup.log
            sudo apt update
            sudo apt install -y ca-certificates curl
            sudo install -m 0755 -d /etc/apt/keyrings
            sudo curl -fsSL https://download.docker.com/linux/debian/gpg -o /etc/apt/keyrings/docker.asc
            sudo chmod a+r /etc/apt/keyrings/docker.asc
            
            # Add the repository to Apt sources:
            echo "Adding Docker's repository to Apt sources..." >> /tmp/setup.log
            echo \
              "deb [arch=$(dpkg --print-architecture) signed-by=/etc/apt/keyrings/docker.asc] https://download.docker.com/linux/debian \
              $(. /etc/os-release && echo "$VERSION_CODENAME") stable" | \
              sudo tee /etc/apt/sources.list.d/docker.list > /dev/null
            
            echo "Updating package list..." >> /tmp/setup.log
            sudo apt update
            
            # Install the Docker packages
            echo "Installing Docker packages..." >> /tmp/setup.log
            sudo apt install -y docker-ce docker-ce-cli containerd.io docker-buildx-plugin docker-compose-plugin
            
            echo "Docker installation completed!" >> /tmp/setup.log
            echo "Setup completed!" >> /tmp/setup.log
        EOT
      + min_cpu_platform           = (known after apply)
        name                       = "terraform-vm"
      - resource_policies          = [] -> null
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/akash1047/zones/us-central1-c/instances/terraform-vm" -> (known after apply)
        tags                       = [
            "http-server",
            "https-server",
            "ssh-server",
            "web-server",
        ]
      ~ tags_fingerprint           = "nD4LioQKlvI=" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                     = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256      = (known after apply)
          - force_attach                    = false -> null
          ~ guest_os_features               = [
              - "UEFI_COMPATIBLE",
              - "VIRTIO_SCSI_MULTIQUEUE",
              - "GVNIC",
              - "SEV_CAPABLE",
              - "SEV_LIVE_MIGRATABLE_V2",
            ] -> (known after apply)
          + kms_key_self_link               = (known after apply)
          ~ source                          = "https://www.googleapis.com/compute/v1/projects/akash1047/zones/us-central1-c/disks/terraform-vm" -> (known after apply)
            # (6 unchanged attributes hidden)

          ~ initialize_params {
              ~ architecture                = "X86_64" -> (known after apply)
              - enable_confidential_compute = false -> null
              ~ image                       = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-12-bookworm-v20250812" -> "debian-cloud/debian-12"
              ~ labels                      = {} -> (known after apply)
              ~ provisioned_iops            = 0 -> (known after apply)
              ~ provisioned_throughput      = 0 -> (known after apply)
              - resource_manager_tags       = {} -> null
              ~ resource_policies           = [] -> (known after apply)
              ~ size                        = 10 -> (known after apply)
              + snapshot                    = (known after apply)
              ~ type                        = "pd-standard" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ confidential_instance_config (known after apply)

      ~ guest_accelerator (known after apply)

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/akash1047/global/networks/terraform-vpc" -> "projects/akash1047/global/networks/terraform-vpc"
          + network_attachment          = (known after apply)
          ~ network_ip                  = "10.0.0.2" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork                  = "https://www.googleapis.com/compute/v1/projects/akash1047/regions/us-central1/subnetworks/terraform-subnet" -> "projects/akash1047/regions/us-central1/subnetworks/terraform-subnet"
          ~ subnetwork_project          = "akash1047" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ access_config {
              ~ nat_ip                 = "34.172.251.118" -> (known after apply)
              ~ network_tier           = "PREMIUM" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ reservation_affinity (known after apply)

      ~ scheduling (known after apply)
      - scheduling {
          - automatic_restart           = true -> null
          - availability_domain         = 0 -> null
          - min_node_cpus               = 0 -> null
          - on_host_maintenance         = "MIGRATE" -> null
          - preemptible                 = false -> null
          - provisioning_model          = "STANDARD" -> null
            # (2 unchanged attributes hidden)
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ vm_external_ip        = "34.172.251.118" -> (known after apply)
  ~ vm_instance_self_link = "https://www.googleapis.com/compute/v1/projects/akash1047/zones/us-central1-c/instances/terraform-vm" -> (known after apply)

```